{"pageProps":{"book":{"id":3,"title":"The Art of Focus Summary","author":"Dan Koe","date":"Feb 10, 2024","affiliateLink":"","impressions":"I was blaming Dan Koe for repeating himself. I was thinking like 'He wants us to achieve something but how can you do it while distracting by his videos? I watched one and got it, that's enough...'. Later, I realized that he has only 80 long form videos, and publishes once or twice a week only. He uses this quote by Samuel Johnson in one of his contents, 'People need to be reminded more often than they need to be instructed.' And I find it very true. You can't blame someone for reminding you something twice a week. It's your responsibility to take action. And they're still 'teaching' in schools, universities 8 hours a day, 5 days a week, you learn near nothing. So, it's not a harmful thing to get a free course about what you want to achieve in life. I think it was my monkey brain and some jealousy. I'm glad that I realized it.","actionableSteps":["Struggle is a universal (uni-verse: one song, harmony) principle. It's not a sign that you're doing something wrong. It's a sign that you're doing something right. Focus, energy and experience are the three pillars to the good life.","In video games, there are NPCs (non player character) that are programmed to 'simply' exist. You can interact, but they stay the same always and never level up. Through social conditioning, most people remain that way. Create macro and micro games to create enjoyment. Macro game is your goal, life's work. 'Micro games are everyday situations. You must approach every situation with an open mind, create your own goal and attempt to win the games that are conductive to your vision. Everything else is a distraction. Do not play those games, if you do, learn from them fast.'","Pause, gain perspective, perceive the situation with no-reaction, make the best choice that actualizes your ideal future.","In the same amount of time, if you make 100 decisions regardless of how you feel, you will make far more progress than if making 1 decision being slave to your thoughts.","Default mode of the brain is to think about the past and future. It's not designed to make you happy. It's designed to keep you alive. You have to train your brain to focus on the present moment.","Default mode of the consciousness is chaos, to be distracted negatively, unless your mind is engaged with a thought, task or stimulus. Dedicate yourself to create the best life for yourself, through self learning, skill acquisition and daily practice. The path is the path of mastery.","Don't fall into trap of quick-fix attitude. Don't close your mind when you encounter the difficulty. Embrace it. Feel the 'runner's high' it presents. Stick through the increasing difficulty of a situation, eventually you'll break through to a state of enjoyment. You don't need a quick fix to learn to walk, speak. Stop looking for cheap dopamine hits. Flow with it."],"quotes":["For every good thought, there are 100 negative thoughts if you do not have the purpose, path or priority in alignment with your ideal future to ground your attention.","It is impossible to change in the known."]}},"__N_SSG":true}